Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Don't worry about this, Vim understands it anyway (except when you have an abbreviation for "fresh", but that's very unlikely).
es_es: No se preocupe, Vim lo entiende de todas formas (a menos que tenga una abreviatura «fresco», pero eso es improbable).

source: To remove all the abbreviations: >
es_es: Para eliminar todas las abreviaturas: >

source: There is one thing to watch out for when defining an abbreviation: The resulting string should not be mapped.
es_es: Existe un aspecto a tener en cuenta a la hora de definir una abreviatura: no debería asignar la cadena resultante a una macro.

source: When you now type @a, you will get "adisk-doorer".
es_es: Si ahora teclea @a, obtendrá «adisk-doorer».

source: To avoid this, use the ":noreabbrev" command.
es_es: Para evitarlo, use la orden «:noabbrev».

source: It does the same as ":abbreviate", but avoids that the resulting string is used for mappings: >
es_es: Hace lo mismo que «:abbreviate», pero evita que la cadena resultante se use en macros.

source: The CTRL-V command is used to insert the next character literally.
es_es: La orden CTRL-V se emplea para insertar el siguiente carácter de forma literal.

source: In other words, any special meaning the character has, it will be ignored.
es_es: En otras palabras, se ignorará el significado especial de cualquier carácter.

source: Inserts an escape character.
es_es: Esta orden inserta un carácter de escapado.

source: Thus you don't leave Insert mode.
es_es: Por ello, no abandona el modo Insertar.

source: (Don't type the space after CTRL-V, it's only to make this easier to read).
es_es: (No escriba un espacio después de CTRL-V, sólo lo hace más fácil de leer).

source: Note: On MS-Windows CTRL-V is used to paste text.
es_es: Nota: En MS-Windows, CTRL-V se emplea para pegar texto.

source: Use CTRL-Q instead of CTRL-V.
es_es: Use CTRL-Q en lugar de CTRL-V.

source: On Unix, on the other hand, CTRL-Q does not work on some terminals, because it has a special meaning.
es_es: Por otra parte, Unix no reconoce CTRL-Q en algunas terminales, porque tiene un significado especial.

source: You can also use the command CTRL-V {digits} to insert a character with the decimal number {digits}.
es_es: También puede usar la orden CTRL-V {dígitos} para insertar un carácter con el número decimal {dígitos}.

source: For example, the character number 127 is the <Del> character (but not necessarily the <Del> key!).
es_es: Por ejemplo, el carácter número 127 es el carácter <Del> (Supr) (¡pero no necesariamente la tecla <Supr>!).

source: To insert <Del> type: >
es_es: Escriba lo siguiente para insetar <Del>.

source: You can enter characters up to 255 this way.
es_es: Puede introducir hasta el carácter 255 de esta manera.

source: When you type fewer than two digits, a non-digit will terminate the command.
es_es: Cuando escribe menos de dos dígitos, un no-dígito finalizará la orden.

source: To avoid the need of typing a non-digit, prepend one or two zeros to make three digits.
es_es: Para evitar la necesidad de escribir un no-dígito, añada uno o dos ceros para sumar tres dígitos.

source: All the next commands insert a <Tab> and then a dot:
es_es: Todas las ordenes a continuación insertan primero un <Tab> y después un punto:

source: This also goes up to character 255 (CTRL-V xff).
es_es: Esto también llega al carácter 255 (CTRL-V xff).

source: You can use "o" to type a character as an octal number and two more methods allow you to type up to a 16 bit and a 32 bit number (e.g., for a Unicode character): >
es_es: También puede usar «o» para escribir un carácter como un número octal, y otros dos métodos le permiten escribir hasta un número en 16 y 32 bit (p, ej., un carácter Unicode): >

source: Vim will display the digraph table.
es_es: Vim mostrará la tabla de dígrafos.

source: Here are three lines of it:
es_es: Aquí puede ver tres líneas:

source: Note: The digraphs depend on the character set that Vim assumes you are using.
es_es: Nota: Los dígrafos dependen del juego de caracteres que Vim asume que está usando.

source: On MS-DOS they are different from MS-Windows.
es_es: En MS-DOS difieren con los de MS-Windows.

source: Always use ":digraphs" to find out which digraphs are currently available.
es_es: Use siempre «:digraphs» para ver de qué dígrafos dispone.

source: You can define your own digraphs.
es_es: Puede configurar sus propios dígrafos.

source: More information about digraphs here: |digraphs| Another way to insert special characters is with a keymap.
es_es: Para más información acerca de los dígrafos, consulte: |digraphs| Otra manera de insertar caracteres especiales es un «keymap».

source: More about that here: |45.5|
es_es: Puede leer más acerca de esto aquí: |45.5|

source: Insert mode offers a limited number of commands.
es_es: El modo Insertar ofrece un limitado número de órdenes.

source: In Normal mode you have many more.
es_es: Dispone de muchas más en el modo normal.

source: When you want to use one, you usually leave Insert mode with <Esc>, execute the Normal mode command, and re-enter Insert mode with "i" or "a".
es_es: Si desea usar uno, abandone el modo Insertar con <Esc>, ejecuto la orden en modo Normal, y vuelva al modo Insertar con «i» o «a».

source: There is a quicker way.
es_es: Hay una manera más rápida.

source: With CTRL-O {command} you can execute any Normal mode command from Insert mode.
es_es: Con CTRL-O {orden} puede ejecutar cualquier orden de modo Normal en el modo Insertar.

source: For example, to delete from the cursor to the end of the line: >
es_es: Por ejemplo, para eliminar desde el cursor hasta el final de la línea: >

source: You can execute only one Normal mode command this way.
es_es: Sólo puede ejecutar una orden de modo Normal de esta manera.

source: But you can specify a register or a count.
es_es: Pero puede especificar un registro o cuenta.

source: A more complicated example: >
es_es: Aquí tiene una manera más complicada: >
